Ran Plan for project: `homeassistant` dir: `repositories/homeassistant` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github_repository.github_repository.repo has been deleted
- resource "github_repository" "repo" {
      - allow_auto_merge       = false -> null
      - allow_merge_commit     = false -> null
      - allow_rebase_merge     = false -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - branches               = [
          - {
              - name      = "main"
              - protected = false
            },
          - {
              - name      = "remove-deprecations"
              - protected = false
            },
        ] -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "My personal Home Assistant config" -> null
      - etag                   = "W/\"b6042b0e4c96024e318f329f3af3d5e8e777dc28e6c8a7db26e2e2bb1dd2bc11\"" -> null
      - full_name              = "glitchcrab/homeassistant" -> null
      - git_clone_url          = "git://github.com/glitchcrab/homeassistant.git" -> null
      - has_downloads          = false -> null
      - has_issues             = true -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/glitchcrab/homeassistant" -> null
      - http_clone_url         = "https://github.com/glitchcrab/homeassistant.git" -> null
      - id                     = "homeassistant" -> null
      - is_template            = false -> null
      - name                   = "homeassistant" -> null
      - node_id                = "MDEwOlJlcG9zaXRvcnkxMDEyNzEyNDM=" -> null
      - private                = false -> null
      - repo_id                = 101271243 -> null
      - ssh_clone_url          = "git@github.com:glitchcrab/homeassistant.git" -> null
      - svn_url                = "https://github.com/glitchcrab/homeassistant" -> null
      - topics                 = [
          - "home-assistant",
          - "home-assistant-config",
          - "home-automation",
          - "homeassistant",
        ] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = false -> null
    }

  # module.github_repository_collaborator.github_repository_collaborator.collaborator has been deleted
- resource "github_repository_collaborator" "collaborator" {
      - id                          = "homeassistant:glitchcrab-bot" -> null
      - invitation_id               = "102735291" -> null
      - permission                  = "push" -> null
      - permission_diff_suppression = false -> null
      - repository                  = "homeassistant" -> null
      - username                    = "glitchcrab-bot" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.github_repository.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "My personal Home Assistant config"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "homeassistant"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "home-assistant",
          + "home-assistant-config",
          + "home-automation",
          + "homeassistant",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = false
    }

  # module.github_repository_collaborator.github_repository_collaborator.collaborator will be created
+ resource "github_repository_collaborator" "collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "homeassistant"
      + username                    = "glitchcrab-bot"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p homeassistant`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=glitchcrab%252Fgithub-repo-management%252Frepositories%252Fhomeassistant%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p homeassistant`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
